---
kind: method
id: M:Autodesk.Revit.DB.UV.IsUnitLength
source: html/22333fac-3aae-f306-467f-bf8691e83067.htm
---
# Autodesk.Revit.DB.UV.IsUnitLength Method

The boolean value indicates whether this 2-D vector is of unit length.

## Syntax (C#)
```csharp
public bool IsUnitLength()
```

## Remarks
A unit length vector has a length of one, and is considered normalized.